content/confd/diagram.puml
@startuml
!include C4_Container.puml

hide stereotype

System_Boundary(confd_platform, "Configuration application"){

    Container(confd, "wazo-confd", "Python", "Configuration service")

    Container(db, "Postgresql", "C", "Database")
    Container(bus, "RabbitMQ", "Erlang", "Messaging Bus")

    Container(provd, "wazo-provd", "Python", "Provisionning service") [["../documentation/overview/provisioning.html"]]
    Container(sysconfd, "wazo-sysconfd", "Python", "Operating system configuration service")
    Container(auth, "wazo-auth", "Python", "Authentication service") [["../documentation/overview/authentication.html"]]
}

actor User

Rel_R(User, confd, "uses", "REST")

Rel_U(confd, db, " ", "SQL")
Rel_U(confd, bus, "Recevied Wazo platform events", "AMQP")

Rel_R(confd, auth, "Authenticates", "REST")
Rel_D(confd, provd, "Configures devices", "REST")
Rel_D(confd, sysconfd, "Runs Operating System commands", "REST")

@enduml
